---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnectionRef
source: html/391ac2c9-f86b-d626-2eb0-ec018b596a43.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnectionRef Property

The selected fitting has invalid connections and must be deleted to continue.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidConnectionRef { get; }
```